## Working with DataFrames

In [6]:
#!/usr/bin/python
# -*- coding: utf-8 -*-

# Inital setup
%precision 3
%matplotlib inline

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt


pd.set_option('max_columns', 50)
path = 'data/ml-100k/'

In [62]:
# Read in user information
u_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table(path + 'u.user', sep='|', names=u_cols)
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [16]:
# Read in raitings
r_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table(path + 'u.data', sep='\t', names=r_cols)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [15]:
# Read in movie information
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv(path + 'u.item', sep='|', names=m_cols, usecols=range(5))
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

### Inspection

In [18]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 78.8+ KB

In [21]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

In [28]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [31]:
ratings.describe()

            user_id       movie_id         rating     timestamp
count  100000.00000  100000.000000  100000.000000  1.000000e+05
mean      462.48475     425.530130       3.529860  8.835289e+08
std       266.61442     330.798356       1.125674  5.343856e+06
min         1.00000       1.000000       1.000000  8.747247e+08
25%       254.00000     175.000000       3.000000  8.794487e+08
50%       447.00000     322.000000       4.000000  8.828269e+08
75%       682.00000     631.000000       4.000000  8.882600e+08
max       943.00000    1682.000000       5.000000  8.932866e+08

In [23]:
movies.tail()

,movie_id,title,release_date,video_release_date,imdb_url
1677,1678,Mat' i syn (1997),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...
1678,1679,B. Monkey (1998),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...
1679,1680,Sliding Doors (1998),01-Jan-1998,NaN,http://us.imdb.com/Title?Sliding+Doors+(1998)
1680,1681,You So Crazy (1994),01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?You%20So%20Cr...
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,NaN,http://us.imdb.com/M/title-exact?Schrei%20aus%...

### Selecting

In [32]:
# Select a single column returning a Series object
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [36]:
# Select multiple columns
print users[['age', 'zip_code']].head()
print
cols = ['occupation', 'gender']
print users[cols].head()

   age zip_code
0   24    85711
1   53    94043
2   23    32067
3   24    43537
4   33    15213

   occupation gender
0  technician      M
1       other      F
2      writer      M
3  technician      M
4       other      F

In [43]:
# Select rows
print users[users['age'] >25].head()
print
print users[(users['age'] == 40) & (users['gender'] == 'M')].head()
print
print users[(users['gender'] == 'F') | (users['age'] < 30)].head()

   user_id  age gender     occupation zip_code
1        2   53      F          other    94043
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201

     user_id  age gender  occupation zip_code
18        19   40      M   librarian    02138
82        83   40      M       other    44133
115      116   40      M  healthcare    97232
199      200   40      M  programmer    93402
283      284   40      M   executive    92629

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [65]:
# Set a new index
with_new_index = users.set_index('user_id')
print with_new_index.head()

# Use inplace=True for in-place change
users.set_index('user_id', inplace=True)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [66]:
# Select rows by position using iloc
print users.iloc[21]
print
print users.iloc[[1, 7, 14]]

age               25
gender             M
occupation    writer
zip_code       40206
Name: 22, dtype: object

         age gender     occupation zip_code
user_id
2         53      F          other    94043
8         36      M  administrator    05201
15        49      F       educator    97301

In [67]:
# Select rows by label using loc
print users.loc[21]
print
print users.loc[[1, 7, 14]]

age               26
gender             M
occupation    writer
zip_code       30068
Name: 21, dtype: object

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
7         57      M  administrator    91344
14        45      M      scientist    55106

In [68]:
# Reset index
users.reset_index(inplace=True)
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Joining

In [69]:
# Prepare mock-up data
left_frame = pd.DataFrame({'key': range(5), 'left_value': list('abcde')})
right_frame = pd.DataFrame({'key': range(2, 7), 'right_value': list('fghij')})
print(left_frame)
print('\n')
print(right_frame)

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

In [70]:
# Inner join (default)
pd.merge(left_frame, right_frame, on='key')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

In [72]:
# Left outer join
pd.merge(left_frame, right_frame, how='left', on='key')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

In [73]:
# Right outer join
pd.merge(left_frame, right_frame, how='right', on='key')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h
3    5        NaN           i
4    6        NaN           j

In [75]:
# Full outer join
pd.merge(left_frame, right_frame, how='outer', on='key')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h
5    5        NaN           i
6    6        NaN           j

### Combining

In [76]:
# Concatenate objects vertically
pd.concat([left_frame, right_frame])

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

In [77]:
# Concatenate objects horizontally
pd.concat([left_frame, right_frame], axis=1)

   key left_value  key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

### Grouping

In [114]:
cols = ['name', 'position', 'department', 'salary']
'''
f = lambda x: float(x.replace('$', ''))
converters={'salary': f}
'''
chicago = pd.read_csv('data/chicago_salaries.csv', header=0, names=cols)
chicago.head()

                  name                  position        department  salary
0      AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT   90744
1    AARON,  JEFFERY M            POLICE OFFICER            POLICE   84450
2       AARON,  KARINA            POLICE OFFICER            POLICE   84450
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES   89880
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  106836

In [119]:
# Method chaining
by_dept = chicago.groupby('department')
print by_dept.count().head() # NOT NULL records within each column
print
print by_dept.size().head() # total records for each department

                   name  position  salary
department
ADMIN HEARNG         39        39      39
ANIMAL CONTRL        67        67      67
AVIATION           1521      1521    1521
BOARD OF ELECTION   117       117     117
BOARD OF ETHICS       9         9       9

department
ADMIN HEARNG           39
ANIMAL CONTRL          67
AVIATION             1521
BOARD OF ELECTION     117
BOARD OF ETHICS         9
dtype: int64

In [127]:
# Caculate sum, mean, and median
print by_dept.sum().head()
print
print by_dept.mean().head()
print
print by_dept.median().head()

                         salary
department
ADMIN HEARNG       2.996364e+06
ANIMAL CONTRL      3.683492e+06
AVIATION           1.119752e+08
BOARD OF ELECTION  6.572532e+06
BOARD OF ETHICS    7.802760e+05

                         salary
department
ADMIN HEARNG       76829.846154
ANIMAL CONTRL      54977.498507
AVIATION           73619.429849
BOARD OF ELECTION  56175.487179
BOARD OF ETHICS    86697.333333

                    salary
department
ADMIN HEARNG       68028.0
ANIMAL CONTRL      56928.0
AVIATION           72862.4
BOARD OF ELECTION  48036.0
BOARD OF ETHICS    81948.0

In [129]:
'''
SELECT department, COUNT(DISTINCT title)
FROM chicago
GROUP BY department
ORDER BY 2 DESC
LIMIT 5;
'''
by_dept.position.nunique().sort_values(ascending=False).head()

department
TRANSPORTN          162
WATER MGMNT         154
POLICE              122
AVIATION            122
GENERAL SERVICES    121
Name: position, dtype: int64

### Split-Apply-Combine

In [135]:
'''
SELECT *
FROM chicago c
INNER JOIN (
    SELECT department, max(salary) max_salary
    FROM chicago
    GROUP BY department
) m
ON c.department = m.department
AND c.salary = m.max_salary;
'''
def ranker(df):
    df['dept_rank'] = np.arange(len(df)) + 1
    return df
chicago.sort_values('salary', ascending=False, inplace=True)
chicago = chicago.groupby('department').apply(ranker)
chicago[chicago.dept_rank == 1].head()

,name,position,department,salary,dept_rank
8184,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,300000,1
7954,"EMANUEL, RAHM",MAYOR,MAYOR'S OFFICE,216210,1
25532,"SANTIAGO, JOSE A",FIRE COMMISSIONER,FIRE,202728,1
8042,"ESCALANTE, JOHN J",FIRST DEPUTY SUPERINTENDENT,POLICE,197724,1
19672,"MORITA, JULIA Y",COMMISSIONER OF HEALTH,HEALTH,177000,1

In [137]:
chicago[chicago.department == 'LAW'].head()

,name,position,department,salary,dept_rank
21933,"PATTON, STEPHEN R",CORPORATION COUNSEL,LAW,173664,1
20697,"NOTZ, JANE E",FIRST ASST CORPORATION COUNSEL,LAW,149160,2
17646,"MARTINICO, JOSEPH P",CHIEF LABOR NEGOTIATOR,LAW,144036,3
22318,"PETERS, LYNDA A",CITY PROSECUTOR,LAW,139932,4
12976,"HURD, MATTHEW A",DEPUTY CORPORATION COUNSEL,LAW,137076,5